Revit 2027 API
GridNode.UIndex Property
The node's index along the U axis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int UIndex { get; set; }
Public Property UIndex As Integer
	Get
	Set
public:
property int UIndex {
	int get ();
	void set (int value);
}
member UIndex : int with get, set
Property Value
Int32
See Also
Reference
GridNode Structure
Autodesk.Revit.DB Namespace